Tekla.Structures.ModelInternal.CDelegateSynchronized
CDelegateSynchronized includes all the platform invokable commands and synchronization to AKIT.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportUIObjectPick(Tekla.Structures.ModelInternal.dotUIPickerWrapper_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportUIObjectsPick(Tekla.Structures.ModelInternal.dotUIPickerWrapper_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateAssembly(Tekla.Structures.ModelInternal.dotAssembly_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportExtractBentPlateFromComponent(System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModifyBendSurfaceNode(System.Int32,System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportComponentGetAttributeFileExtension(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.String@)
Gets the file extension of  attributes for a given object type.
pBaseComponent: The object type.
fileExtension: The attribute file extension.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportComponentSaveAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.String)
Saves the applied attributes for a given object type.
pBaseComponent: The object type.
fileName: The applied attribute names.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportComponentLoadAndSaveToAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.String)
Loads and saves the applied attributes for a given object type from a file.
pBaseComponent: The object type.
fileName: The applied attribute names.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportComponentGetAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.Collections.Generic.List{System.Object}@,System.Collections.Generic.List{System.Object}@,System.Boolean)
Gets the applied attributes for a given object type.
baseComponent: The object type.
pNames: The applied attribute names.
pValues: The applied attribute values.
ignoreDefaultValues: Fetch also attributes with default attribute values.

Tekla.Structures.ModelInternal.CDelegateSynchronized.SetStringPropertyValueToStruct(System.Int32,System.Object,Tekla.Structures.ModelInternal.dotGetProperties_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.SetPropertyNameToStruct(System.Int32,System.Object,Tekla.Structures.ModelInternal.dotGetProperties_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.SetPropertyNameAndValueToStruct(System.Int32,System.Object,System.Object,Tekla.Structures.ModelInternal.dotGetProperties_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.SetPropertyStruct(System.Collections.Generic.List{System.Object}@,System.Collections.Generic.List{System.Object}@,System.Int32@,Tekla.Structures.ModelInternal.dotGetProperties_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportComponentSetAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.Collections.Generic.List{System.Object}@,System.Collections.Generic.List{System.Object}@,System.Boolean)
Sets the applied attributes for a given object type.
baseComponent: The object type.
pNames: The applied attribute names.
pValues: The applied attribute values.
addNewAttributes: Are new attributes registered to internal component data storage.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportComponentDeleteAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.Collections.Generic.List{System.String}@)
Deletes the attributes for a given object type.
baseComponent: The object type.
attributeNames: The applied attribute names.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCalculateContourPolygon(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@)
DO NOT USE! For internal usage only.
contour: The contour.
polygon: The polygon.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSelectPart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetBoltedPartsHoleElevations(System.Int32,System.Collections.Generic.Dictionary{System.Int32,System.Tuple{System.Double,System.Double}})
DO NOT USE! For internal usage only.
boltId: The bolt identifier.
holeElevations: The hole elevations.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetFabricatorProject(Tekla.Structures.ModelInternal.dotFabricatorProject_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModifyFabricatorProject(Tekla.Structures.ModelInternal.dotFabricatorProject_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.RegisterExcelDialogOpeningCallback(Tekla.Structures.Model.Internal.IReportingExcelDialogCallback)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetAttributeFiles(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
Gets all attribute files with specified suffix.
data: The data.
Returns: Number of files found.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetAttributeFilesWithPrefix(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
Gets all attribute files with specified prefix and suffix.
data: The data.
Returns: Number of files found.

Tekla.Structures.ModelInternal.CDelegateSynchronized.GetOverlayModelEntityIdsFromIfcGuids(System.String,System.Collections.Generic.List{System.String},System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetOverlayModelEntitiesIfcGuidsFromIds(System.String,System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.String}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetViewVisibilityFilterValue(System.Int32,System.String@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetStringPropertyFromDatabase(Tekla.Structures.ModelInternal.dotStringProperty_t@,System.Collections.Generic.List{System.String}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSetStringPropertyToDatabase(Tekla.Structures.ModelInternal.dotStringProperty_t@,System.Collections.Generic.List{System.String}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetSnapshotFromDatabase(Tekla.Structures.ModelInternal.dotEnumerator_t@,System.Boolean)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateViewSnapshotToFile(System.String,System.Int32,Tekla.Structures.Model.UI.SnapshotSettings,System.Boolean)


Tekla.Structures.ModelInternal.CDelegateSynchronized.FetchModelObject(Tekla.Structures.Identifier,System.String,System.Boolean)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportFetchFromDatabase(System.Collections.Generic.List{System.String}@,System.Boolean)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportFetchFromDatabaseWithIds(System.Collections.Generic.List{System.Int32}@,System.Boolean)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetSolidSerialized(Tekla.Structures.ModelInternal.dotSolid_t@,System.Collections.Generic.List{System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}}}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetSolidMerged(Tekla.Structures.ModelInternal.dotSolid_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetCutSolidSerialized(Tekla.Structures.ModelInternal.dotSolid_t@,Tekla.Structures.ModelInternal.dotSolid_t@,System.Collections.Generic.List{System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}}}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportDasStartCommand(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportDasStartAction(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSaveOperation(Tekla.Structures.ModelInternal.dotSaveOperation_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportUndoOperation(Tekla.Structures.ModelInternal.dotUndoOperation_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportBhMoveObjects(Tekla.Structures.ModelInternal.dotClientId_t@,Tekla.Structures.Internal.dotPoint_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportFingerprint(Tekla.Structures.ModelInternal.dotPolymesh_t@,System.String@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateNewModel(Tekla.Structures.ModelInternal.dotModelInfo_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSharingOperation(Tekla.Structures.ModelInternal.dotSharingOperation_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModel2Operation(Tekla.Structures.ModelInternal.dotModel2Operation_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportExternalDrawOperation(Tekla.Structures.ModelInternal.dotExternalDrawOperation_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportTranslateLabel(Tekla.Structures.ModelInternal.dotTranslateLabel_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModifyRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSelectRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModifyRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSelectRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)
DO NOT USE! For internal usage only.
pStrip: The strip.
dotSpacingElementList: The spacing elements.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModifyRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)
DO NOT USE! For internal usage only.
pStrip: The strip.
dotSpacingElementList: The spacing elements.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSelectRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)
DO NOT USE! For internal usage only.
pStrip: The strip.
dotSpacingElementList: The spacing elements.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModifyRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSelectRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModifyRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSelectRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportChangeLegFaceLayer(System.Collections.Generic.List{System.Int32}@,System.Int32,System.Int32)
DO NOT USE! For internal usage only.
dotLegFaces:
rebarSetId:
change:
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSingleRebarGetRebarSet(System.Int32)
DO NOT USE! For internal usage only.
singleRebarId: The single rebar ID.
Returns: The rebar set ID if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetShapeMetadata(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only.
guid: GUID of the shape whose metadata we are getting
clientId: Client ID to identify the communication partners.
Returns: Returns 1 if successful, 0 otherwise.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSelectLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModifyLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateLegSurfaceByFace(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32,System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ImportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ImportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ImportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportPathListHandler(Tekla.Structures.ModelInternal.dotnetPathList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ImportPathListHandler(Tekla.Structures.ModelInternal.dotnetPathList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ImportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportEdgeListHandler(Tekla.Structures.ModelInternal.dotnetEdgeList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ImportEdgeListHandler(Tekla.Structures.ModelInternal.dotnetEdgeList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetRenderingColorIndex(Tekla.Structures.Model.UI.Color,System.Collections.Generic.List{Render.Color}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportRenderGraphicContainer(System.Int32,Tekla.Structures.ModelInternal.dotGraphicObjectContainer_t@,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicLine}@,System.Collections.Generic.List{Tekla.Structures.Model.UI.GraphicPolyLine}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicFace}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicText}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportDeleteGraphicObjectContainer(Tekla.Structures.ModelInternal.dotGraphicObjectContainer_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportDeleteAllGraphicObjectContainers(Tekla.Structures.ModelInternal.dotGraphicObjectContainer_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCalculateContourPolygon(Tekla.Structures.ModelInternal.dotContourPoint_t*,System.Int32,Tekla.Structures.Internal.dotPoint_t*@,System.Int32@)
DO NOT USE! For internal usage only.
pContour: The contour.
ContourSize: The contour size.
ppPolygon: The polygon.
pPolygonSize: The polygon size.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateAssembly(Tekla.Structures.ModelInternal.dotAssembly_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSetNewBentPlateRoot(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId: The node identifier.
clientId: The client identifier.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModifyBendAngle(System.Double,System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
angle: The angle.
curvedNodeId: The node identifier.
movingNodeId: The direction node identifier.
clientId: The client identifier.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetBoltedPartsHoleElevations(System.Int32,System.Int32@,System.Int32*@,System.Double*@,System.Double*@)
DO NOT USE! For internal usage only!
boltId: The bolt identifier.
pnPoints: Number of points.
ppParts: Part list
ppFirstPoint: The first elevation point list
ppSecondPoint: the second elevation point list
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSaveOperation(Tekla.Structures.ModelInternal.dotSaveOperation_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportUndoOperation(Tekla.Structures.ModelInternal.dotUndoOperation_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotImportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotImportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotImportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportPathListHandler(Tekla.Structures.ModelInternal.dotnetPathList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotImportPathListHandler(Tekla.Structures.ModelInternal.dotnetPathList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotImportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportEdgeListHandler(Tekla.Structures.ModelInternal.dotnetEdgeList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotImportEdgeListHandler(Tekla.Structures.ModelInternal.dotnetEdgeList_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportShadowArea(Tekla.Structures.ModelInternal.dotAreaPolygons_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportShadowAreaComplement(Tekla.Structures.ModelInternal.dotAreaPolygons_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotLegFace_t*,Tekla.Structures.ModelInternal.dotGuideline_t*,Tekla.Structures.ModelInternal.dotContourPoint_t*,Tekla.Structures.ModelInternal.dotSpacingZone_t*,Tekla.Structures.ModelInternal.dotSpacingElement_t*)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModifyRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotLegFace_t*,Tekla.Structures.ModelInternal.dotGuideline_t*,Tekla.Structures.ModelInternal.dotContourPoint_t*,Tekla.Structures.ModelInternal.dotSpacingZone_t*,Tekla.Structures.ModelInternal.dotSpacingElement_t*)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSelectRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotLegFace_t*@,Tekla.Structures.ModelInternal.dotGuideline_t*@,Tekla.Structures.ModelInternal.dotContourPoint_t*@,Tekla.Structures.ModelInternal.dotSpacingZone_t*@,Tekla.Structures.ModelInternal.dotSpacingElement_t*@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,Tekla.Structures.ModelInternal.dotLegFace_t*,Tekla.Structures.ModelInternal.dotContourPoint_t*)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModifyRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,Tekla.Structures.ModelInternal.dotLegFace_t*,Tekla.Structures.ModelInternal.dotContourPoint_t*)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSelectRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,Tekla.Structures.ModelInternal.dotLegFace_t*@,Tekla.Structures.ModelInternal.dotContourPoint_t*@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSetAdvancedOption(Tekla.Structures.Internal.dotGetAdvancedOption_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetSetModstamp(Tekla.Structures.ModelInternal.dotModStamp_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModStampCompare(Tekla.Structures.ModelInternal.dotModStampCompare_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetBeamPositioningBox(Tekla.Structures.ModelInternal.dotBeamPositioningBox_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotGrdrShowPreviewDrawing(System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,Tekla.Structures.ModelInternal.dotSpacingElement_t*)
DO NOT USE! For internal usage only.
pStrip: The strip.
ppSpacingElements: The spacing elements.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModifyRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,Tekla.Structures.ModelInternal.dotSpacingElement_t*)
DO NOT USE! For internal usage only.
pStrip: The strip.
ppSpacingElements: The spacing elements.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSelectRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,Tekla.Structures.ModelInternal.dotSpacingElement_t*@)
DO NOT USE! For internal usage only.
pStrip: The strip.
ppSpacingElements: The spacing elements.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModifyRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSelectRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModifyRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSelectRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportChangeLegFaceLayer(System.Int32,System.Int32*,System.Int32,System.Int32)
DO NOT USE! For internal usage only.
rebarSetId: The owning rebarset.
pLegFaceIds: The ids of the faces to change.
count: The number of faces.
action: The action to perform.
Returns: True if successful.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSingleRebarGetRebarSet(System.Int32)
DO NOT USE! For internal usage only.
singleRebarId: The single rebar ID.
Returns: The rebar set ID if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetShapeMetadata(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only.
guid: The GUID of the shape.
clientId: Calling client ID.
Returns: 1 if getting the metadata was successful, 0 otherwise

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateSurfaceObject(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSelectSurfaceObject(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModifySurfaceObject(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSelectLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModifyLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateSurfaceByFace(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateSurfaceByFaceAndAttrib(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32,System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateLegSurfaceByFace(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32,System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetAssociateSurfaces(System.Int32,System.Int32*@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetParentObject(System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetAssemblyId(System.Int32,System.Int32@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetObjectAssemblyPrimary(System.Int32,System.Int32@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetSurfaceGeometryType(System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateConversionLink(Tekla.Structures.ModelInternal.dotConversionLink_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSelectConversionLink(Tekla.Structures.ModelInternal.dotConversionLink_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportDeleteConversionLink(Tekla.Structures.ModelInternal.dotConversionLink_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCheckObject1ModifiedAfterObject2(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotIdentifier_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportObjectIncludedToCopyOrMoveOperation(Tekla.Structures.Internal.dotIdentifier_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportObjectsIncludedToCopyOrMoveOperation(Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetReferenceModelObjectByExternalGuid(System.Int32,Tekla.Structures.Internal.dotIdentifier_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetFirstReferenceModelObjectByExternalGuid(Tekla.Structures.Internal.dotIdentifier_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetDatabaseVersion(System.Int32@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportRunDataRetrieverCommand(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportFingerprint(Tekla.Structures.ModelInternal.dotPolymesh_t@,System.Text.StringBuilder)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModelTestingFeaturesHandler(Tekla.Structures.ModelInternal.dotModelTestingFeaturesHandler_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportBatchEditorHandler(Tekla.Structures.ModelInternal.dotBatchEditorHandler_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportFabricationHandler(Tekla.Structures.ModelInternal.dotFabricationHandler_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportMarkObjectModifiedForOrganizer(System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateViewSnapshotToFile(System.String,System.Int32,Tekla.Structures.Model.UI.SnapshotSettings,System.Boolean)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotGetAvailableProfiles(Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotGetAvailableMaterials(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotGetMousePositionInModelCoordinates(Tekla.Structures.Internal.dotPoint_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.ModelInternal.dotUIPicker_t@,System.IAsyncResult)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCalculateContourPolycurve(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}@)
DO NOT USE! For internal usage only.
contour: The contour.
CurvePoints: The polycurve.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetObjectAttribute(System.Int32,System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only.
objectId:
attributeName:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetAvailableCustomPropertyNames(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only.
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateSynchronized.AutomatedTesting_BroadcastMessage(System.String)
DO NOT USE! For internal usage only.
testMessage:
Returns:

Tekla.Structures.ModelInternal.CDelegateSynchronized.WriteTrbCreatedEvent
DO NOT USE! For internal usage only.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModelTestingFeaturesHandler(Tekla.Structures.ModelInternal.dotModelTestingFeaturesHandler_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetPartExtrema(System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModelFeaturesHandler(Tekla.Structures.ModelInternal.dotModelFeaturesHandler_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportBatchEditorHandler(Tekla.Structures.ModelInternal.dotBatchEditorHandler_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportFabricationHandler(Tekla.Structures.ModelInternal.dotFabricationHandler_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportUIObjectHighlight(Tekla.Structures.ModelInternal.dotUIModelObjectHighlighter_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.StartLiveSharing(Tekla.Structures.Model.Internal.IChangeSetCreatedCallback,System.Guid,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.StopLiveSharing(System.Guid)


Tekla.Structures.ModelInternal.CDelegateSynchronized.CreateBaseline(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32,Tekla.Structures.Model.Internal.ICancellableProgressReportCallback)


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetPendingChangeSets(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.AddChangeSet(System.String,System.String,System.Byte[])


Tekla.Structures.ModelInternal.CDelegateSynchronized.RemoveChangeSet(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetEventTimeGuid(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.EventsDbTimeOrdered(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.WriteEventToDatabase(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.RenameEvent(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.HighlightSelectedBoltParts(System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.HighlightConnectedObjects(System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.UnhighlightConnectedObjects


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetTSLanguageCultureString


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetAvailableProfiles(Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetAvailableMaterials(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetNumberingTemporaryRecordList
DO NOT USE! For internal usage only.
Get numbering temporary record list data.
Returns: a byte array for protobuf use

Tekla.Structures.ModelInternal.CDelegateSynchronized.RunNumberingCommandWithPreview(System.Boolean,System.Boolean)
DO NOT USE! For internal usage only.
Execute numbering selected series of objects with preview functionality
Returns: 1 or 0

Tekla.Structures.ModelInternal.CDelegateSynchronized.AcceptNumberingResults
DO NOT USE! For internal usage only.
Accept the numbering results
Returns: 1 or 0

Tekla.Structures.ModelInternal.CDelegateSynchronized.RejectNumberingResults
DO NOT USE! For internal usage only.
Reject the numbering results (cancel numbering)
Returns: 1 or 0

Tekla.Structures.ModelInternal.CDelegateSynchronized.GetNumberingSettings(Tekla.Structures.ModelInternal.dotNumberingSettingsType_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetReportProperty(System.String,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.CheckABMNumbering(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotCheckABMResult_t}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetDeletedSubmittedPartsCount(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ProcessABMNumbering(System.Collections.Generic.List{System.Int32})


Tekla.Structures.ModelInternal.CDelegateSynchronized.UnnumberProcurementParts(System.Collections.Generic.List{System.Int32})


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetAbmSettings(Tekla.Structures.ModelInternal.dotAbmSettings_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.SetAbmSettings(Tekla.Structures.ModelInternal.dotAbmSettings_t@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ClearOldFabricatorSettings


Tekla.Structures.ModelInternal.CDelegateSynchronized.GetNormalizedPlateProfileName(System.Int32,System.Int32)


Tekla.Structures.ModelInternal.CDelegateSynchronized.IsValidFabricatorProfile(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.IsValidFabricatorMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.IsValidFabricatorFinish(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.IsProfileAccepted(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.IsMaterialAccepted(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.IsFinishAccepted(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.AddAcceptedProfile(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.AddAcceptedMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.AddAcceptedFinish(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.DeleteAcceptedProfile(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.DeleteAcceptedMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.DeleteAcceptedFinish(System.String)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ClearVirtualBarCache
DO NOT USE! For internal usage only.
Clear the virtual rebar cache
Returns: 1 or 0

Tekla.Structures.ModelInternal.CDelegateSynchronized.RegisterAssertCallback(Tekla.Structures.Model.Internal.IAssertEventCallback)


Tekla.Structures.ModelInternal.CDelegateSynchronized.MarshalStringListToUnmanagedArray(System.Collections.Generic.List{System.String},System.IntPtr)
Marshals a managed list of strings to an unmanaged array of strings.
managedStrings: The list of managed strings.
unmanagedArray: The pointer to the unmanaged array.
Returns: A pointer to the unmanaged array.

Tekla.Structures.ModelInternal.CDelegateSynchronized.FreeUnmanagedStringArray(System.IntPtr,System.Int32)
Frees the memory allocated for an unmanaged array of strings.
unmanagedArray: The pointer to the unmanaged array.
length: The length of the array.